#!/usr/bin/python
# -*- coding: utf-8 -*-

# ===================================================
# 何回テストしたら良いか計算してくれるスクリプト
# 各変数は以下の通り．
# N : 母集団の大きさ
# n : サンプルすべき標本の大きさ
# P : 母比率の予想値
# e : 信頼度95%での標本誤差の許容値
# 参考サイト : http://www.rikkyo.ne.jp/~ssakata/class/academy/materials/06.html
# 例
# 一軸の分解能を10，七自由度とすると N = 10**7
# 母比率は予想できないが，0.5が最大になる．
# eは許容誤差なので2%くらいにはしたい．ので e = 0.02
# こんな感じ
# ===================================================

N = 10.**7
P = 0.5
e = 0.02

bunshi = N
bunbo = ( (N-1.)*(e**2) )/( (1.96**2)*P*(1.-P) ) + 1.

n = bunshi/bunbo

print n
